RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/serialization/application/codecs/ble/serializers/ble_gap_app.h
#if NRF_SD_BLE_API_VERSION >= 4
/**
 * @brief Encodes @ref sd_ble_gap_data_length_update command request.
 *
 * @sa @ref ble_gap_data_length_update_rsp_dec for command response decoder.
 *
 * @param[in]     conn_handle        Connection handle.
 * @param[in]     p_dl_params        Pointer to a data length params structure.
 * @param[out]    p_dl_limitation    Pointer to a data length limitation structure.
 * @param[in,out] p_buf              Pointer to buffer where encoded data command will be returned.
 * @param[in,out] p_buf_len          \c in: size of \p p_buf buffer.
 *                                   \c out: Length of encoded command packet.
 *
 * @retval NRF_SUCCESS               Encoding success.
 * @retval NRF_ERROR_NULL            Encoding failure. NULL pointer supplied.
 * @retval NRF_ERROR_INVALID_LENGTH  Encoding failure. Incorrect buffer length.
 */
uint32_t ble_gap_data_length_update_req_enc(uint16_t                             conn_handle,
                                            ble_gap_data_length_params_t const * p_dl_params,
                                            ble_gap_data_length_limitation_t *   p_dl_limitation,
                                            uint8_t * const                      p_buf,
                                            uint32_t * const                     p_buf_len);
/**
 * @brief Decodes response to @ref sd_ble_gap_data_length_update command.
 *
 * @sa @ref ble_gap_data_length_update_req_enc for command request encoder.
 *
 * @param[in]  p_buf           Pointer to beginning of command response packet.
 * @param[in]  packet_len      Length (in bytes) of response packet.
 * @param[out] p_dl_limitation Pointer to a data length limitation structure.
 * @param[out] p_result_code   Command result code.
 *
 * @retval NRF_SUCCESS               Decoding success.
 * @retval NRF_ERROR_NULL            Decoding failure. NULL pointer supplied.
 * @retval NRF_ERROR_INVALID_LENGTH  Decoding failure. Incorrect buffer length.
 * @retval NRF_ERROR_INVALID_DATA    Decoding failure. Decoded operation code does not match
 *                                   expected operation code.
 */
uint32_t ble_gap_data_length_update_rsp_dec(uint8_t const * const              p_buf,
                                            uint32_t                           packet_len,
                                            ble_gap_data_length_limitation_t * p_dl_limitation,
                                            uint32_t * const                   p_result_code);
#endif

#if NRF_SD_BLE_API_VERSION >= 5
/**@brief Encodes @ref sd_ble_gap_phy_request command request.
 *
 * @sa @ref ble_gap_phy_request_rsp_dec for command response decoder.
 *
 * @param[in]      conn_handle    Connection handle of the connection.
 * @param[in]      p_gap_phys     Pointer to a @ref ble_gap_phys_t
 *                                structure.
 * @param[in]      p_buf          Pointer to buffer where encoded data command will be returned.
 * @param[in, out] p_buf_len      \c in: size of \p p_buf buffer.
 *                                \c out: Length of encoded command packet.
 *
 * @retval NRF_SUCCESS                Encoding success.
 * @retval NRF_ERROR_NULL             Encoding failure. NULL pointer supplied.
 * @retval NRF_ERROR_INVALID_LENGTH   Encoding failure. Incorrect buffer length.
 */
uint32_t ble_gap_phy_request_req_enc(uint16_t               conn_handle,
                                     ble_gap_phys_t const * p_gap_phys,
                                     uint8_t * const        p_buf,
                                     uint32_t * const       p_buf_len);

/**@brief Decodes response to @ref sd_ble_gap_phy_request command.
 *
 * @sa @ref ble_gap_phy_request_req_enc for command request encoder.
 *
 * @param[in]  p_buf           Pointer to beginning of command response packet.
 * @param[in]  packet_len      Length (in bytes) of response packet.
 * @param[out] p_result_code   Command response result code.
 *
 * @retval NRF_SUCCESS              Decoding success.
 * @retval NRF_ERROR_NULL           Decoding failure. NULL pointer supplied.
 * @retval NRF_ERROR_DATA_SIZE      Decoding failure. Incorrect buffer length.
 * @retval NRF_ERROR_INVALID_DATA   Decoding failure. Decoded operation code does not match expected
 *                                  operation code.
 */
uint32_t ble_gap_phy_request_rsp_dec(uint8_t const * const p_buf,
                                     uint32_t              packet_len,
                                     uint32_t * const      p_result_code);
#endif
/** @} */

#ifdef __cplusplus
}
#endif

#endif
